{
  "move_to_action": {
    "a1b1": 0,
    "a1c1": 1,
    "a1d1": 2,
    "a1e1": 3,
    "a1f1": 4,
    "a1g1": 5,
    "a1h1": 6,
    "a1a2": 7,
    "a1b2": 8,
    "a1a3": 9,
    "a1c3": 10,
    "a1a4": 11,
    "a1d4": 12,
    "a1a5": 13,
    "a1e5": 14,
    "a1a6": 15,
    "a1f6": 16,
    "a1a7": 17,
    "a1g7": 18,
    "a1a8": 19,
    "a1h8": 20,
    "a1c2": 21,
    "a1b3": 22,
    "b1a1": 23,
    "b1c1": 24,
    "b1d1": 25,
    "b1e1": 26,
    "b1f1": 27,
    "b1g1": 28,
    "b1h1": 29,
    "b1a2": 30,
    "b1b2": 31,
    "b1c2": 32,
    "b1b3": 33,
    "b1d3": 34,
    "b1b4": 35,
    "b1e4": 36,
    "b1b5": 37,
    "b1f5": 38,
    "b1b6": 39,
    "b1g6": 40,
    "b1b7": 41,
    "b1h7": 42,
    "b1b8": 43,
    "b1d2": 44,
    "b1a3": 45,
    "b1c3": 46,
    "c1a1": 47,
    "c1b1": 48,
    "c1d1": 49,
    "c1e1": 50,
    "c1f1": 51,
    "c1g1": 52,
    "c1h1": 53,
    "c1b2": 54,
    "c1c2": 55,
    "c1d2": 56,
    "c1a3": 57,
    "c1c3": 58,
    "c1e3": 59,
    "c1c4": 60,
    "c1f4": 61,
    "c1c5": 62,
    "c1g5": 63,
    "c1c6": 64,
    "c1h6": 65,
    "c1c7": 66,
    "c1c8": 67,
    "c1a2": 68,
    "c1e2": 69,
    "c1b3": 70,
    "c1d3": 71,
    "d1a1": 72,
    "d1b1": 73,
    "d1c1": 74,
    "d1e1": 75,
    "d1f1": 76,
    "d1g1": 77,
    "d1h1": 78,
    "d1c2": 79,
    "d1d2": 80,
    "d1e2": 81,
    "d1b3": 82,
    "d1d3": 83,
    "d1f3": 84,
    "d1a4": 85,
    "d1d4": 86,
    "d1g4": 87,
    "d1d5": 88,
    "d1h5": 89,
    "d1d6": 90,
    "d1d7": 91,
    "d1d8": 92,
    "d1b2": 93,
    "d1f2": 94,
    "d1c3": 95,
    "d1e3": 96,
    "e1a1": 97,
    "e1b1": 98,
    "e1c1": 99,
    "e1d1": 100,
    "e1f1": 101,
    "e1g1": 102,
    "e1h1": 103,
    "e1d2": 104,
    "e1e2": 105,
    "e1f2": 106,
    "e1c3": 107,
    "e1e3": 108,
    "e1g3": 109,
    "e1b4": 110,
    "e1e4": 111,
    "e1h4": 112,
    "e1a5": 113,
    "e1e5": 114,
    "e1e6": 115,
    "e1e7": 116,
    "e1e8": 117,
    "e1c2": 118,
    "e1g2": 119,
    "e1d3": 120,
    "e1f3": 121,
    "f1a1": 122,
    "f1b1": 123,
    "f1c1": 124,
    "f1d1": 125,
    "f1e1": 126,
    "f1g1": 127,
    "f1h1": 128,
    "f1e2": 129,
    "f1f2": 130,
    "f1g2": 131,
    "f1d3": 132,
    "f1f3": 133,
    "f1h3": 134,
    "f1c4": 135,
    "f1f4": 136,
    "f1b5": 137,
    "f1f5": 138,
    "f1a6": 139,
    "f1f6": 140,
    "f1f7": 141,
    "f1f8": 142,
    "f1d2": 143,
    "f1h2": 144,
    "f1e3": 145,
    "f1g3": 146,
    "g1a1": 147,
    "g1b1": 148,
    "g1c1": 149,
    "g1d1": 150,
    "g1e1": 151,
    "g1f1": 152,
    "g1h1": 153,
    "g1f2": 154,
    "g1g2": 155,
    "g1h2": 156,
    "g1e3": 157,
    "g1g3": 158,
    "g1d4": 159,
    "g1g4": 160,
    "g1c5": 161,
    "g1g5": 162,
    "g1b6": 163,
    "g1g6": 164,
    "g1a7": 165,
    "g1g7": 166,
    "g1g8": 167,
    "g1e2": 168,
    "g1f3": 169,
    "g1h3": 170,
    "h1a1": 171,
    "h1b1": 172,
    "h1c1": 173,
    "h1d1": 174,
    "h1e1": 175,
    "h1f1": 176,
    "h1g1": 177,
    "h1g2": 178,
    "h1h2": 179,
    "h1f3": 180,
    "h1h3": 181,
    "h1e4": 182,
    "h1h4": 183,
    "h1d5": 184,
    "h1h5": 185,
    "h1c6": 186,
    "h1h6": 187,
    "h1b7": 188,
    "h1h7": 189,
    "h1a8": 190,
    "h1h8": 191,
    "h1f2": 192,
    "h1g3": 193,
    "a2a1": 194,
    "a2b1": 195,
    "a2b2": 196,
    "a2c2": 197,
    "a2d2": 198,
    "a2e2": 199,
    "a2f2": 200,
    "a2g2": 201,
    "a2h2": 202,
    "a2a3": 203,
    "a2b3": 204,
    "a2a4": 205,
    "a2c4": 206,
    "a2a5": 207,
    "a2d5": 208,
    "a2a6": 209,
    "a2e6": 210,
    "a2a7": 211,
    "a2f7": 212,
    "a2a8": 213,
    "a2g8": 214,
    "a2c1": 215,
    "a2c3": 216,
    "a2b4": 217,
    "b2a1": 218,
    "b2b1": 219,
    "b2c1": 220,
    "b2a2": 221,
    "b2c2": 222,
    "b2d2": 223,
    "b2e2": 224,
    "b2f2": 225,
    "b2g2": 226,
    "b2h2": 227,
    "b2a3": 228,
    "b2b3": 229,
    "b2c3": 230,
    "b2b4": 231,
    "b2d4": 232,
    "b2b5": 233,
    "b2e5": 234,
    "b2b6": 235,
    "b2f6": 236,
    "b2b7": 237,
    "b2g7": 238,
    "b2b8": 239,
    "b2h8": 240,
    "b2d1": 241,
    "b2d3": 242,
    "b2a4": 243,
    "b2c4": 244,
    "c2b1": 245,
    "c2c1": 246,
    "c2d1": 247,
    "c2a2": 248,
    "c2b2": 249,
    "c2d2": 250,
    "c2e2": 251,
    "c2f2": 252,
    "c2g2": 253,
    "c2h2": 254,
    "c2b3": 255,
    "c2c3": 256,
    "c2d3": 257,
    "c2a4": 258,
    "c2c4": 259,
    "c2e4": 260,
    "c2c5": 261,
    "c2f5": 262,
    "c2c6": 263,
    "c2g6": 264,
    "c2c7": 265,
    "c2h7": 266,
    "c2c8": 267,
    "c2a1": 268,
    "c2e1": 269,
    "c2a3": 270,
    "c2e3": 271,
    "c2b4": 272,
    "c2d4": 273,
    "d2c1": 274,
    "d2d1": 275,
    "d2e1": 276,
    "d2a2": 277,
    "d2b2": 278,
    "d2c2": 279,
    "d2e2": 280,
    "d2f2": 281,
    "d2g2": 282,
    "d2h2": 283,
    "d2c3": 284,
    "d2d3": 285,
    "d2e3": 286,
    "d2b4": 287,
    "d2d4": 288,
    "d2f4": 289,
    "d2a5": 290,
    "d2d5": 291,
    "d2g5": 292,
    "d2d6": 293,
    "d2h6": 294,
    "d2d7": 295,
    "d2d8": 296,
    "d2b1": 297,
    "d2f1": 298,
    "d2b3": 299,
    "d2f3": 300,
    "d2c4": 301,
    "d2e4": 302,
    "e2d1": 303,
    "e2e1": 304,
    "e2f1": 305,
    "e2a2": 306,
    "e2b2": 307,
    "e2c2": 308,
    "e2d2": 309,
    "e2f2": 310,
    "e2g2": 311,
    "e2h2": 312,
    "e2d3": 313,
    "e2e3": 314,
    "e2f3": 315,
    "e2c4": 316,
    "e2e4": 317,
    "e2g4": 318,
    "e2b5": 319,
    "e2e5": 320,
    "e2h5": 321,
    "e2a6": 322,
    "e2e6": 323,
    "e2e7": 324,
    "e2e8": 325,
    "e2c1": 326,
    "e2g1": 327,
    "e2c3": 328,
    "e2g3": 329,
    "e2d4": 330,
    "e2f4": 331,
    "f2e1": 332,
    "f2f1": 333,
    "f2g1": 334,
    "f2a2": 335,
    "f2b2": 336,
    "f2c2": 337,
    "f2d2": 338,
    "f2e2": 339,
    "f2g2": 340,
    "f2h2": 341,
    "f2e3": 342,
    "f2f3": 343,
    "f2g3": 344,
    "f2d4": 345,
    "f2f4": 346,
    "f2h4": 347,
    "f2c5": 348,
    "f2f5": 349,
    "f2b6": 350,
    "f2f6": 351,
    "f2a7": 352,
    "f2f7": 353,
    "f2f8": 354,
    "f2d1": 355,
    "f2h1": 356,
    "f2d3": 357,
    "f2h3": 358,
    "f2e4": 359,
    "f2g4": 360,
    "g2f1": 361,
    "g2g1": 362,
    "g2h1": 363,
    "g2a2": 364,
    "g2b2": 365,
    "g2c2": 366,
    "g2d2": 367,
    "g2e2": 368,
    "g2f2": 369,
    "g2h2": 370,
    "g2f3": 371,
    "g2g3": 372,
    "g2h3": 373,
    "g2e4": 374,
    "g2g4": 375,
    "g2d5": 376,
    "g2g5": 377,
    "g2c6": 378,
    "g2g6": 379,
    "g2b7": 380,
    "g2g7": 381,
    "g2a8": 382,
    "g2g8": 383,
    "g2e1": 384,
    "g2e3": 385,
    "g2f4": 386,
    "g2h4": 387,
    "h2g1": 388,
    "h2h1": 389,
    "h2a2": 390,
    "h2b2": 391,
    "h2c2": 392,
    "h2d2": 393,
    "h2e2": 394,
    "h2f2": 395,
    "h2g2": 396,
    "h2g3": 397,
    "h2h3": 398,
    "h2f4": 399,
    "h2h4": 400,
    "h2e5": 401,
    "h2h5": 402,
    "h2d6": 403,
    "h2h6": 404,
    "h2c7": 405,
    "h2h7": 406,
    "h2b8": 407,
    "h2h8": 408,
    "h2f1": 409,
    "h2f3": 410,
    "h2g4": 411,
    "a3a1": 412,
    "a3c1": 413,
    "a3a2": 414,
    "a3b2": 415,
    "a3b3": 416,
    "a3c3": 417,
    "a3d3": 418,
    "a3e3": 419,
    "a3f3": 420,
    "a3g3": 421,
    "a3h3": 422,
    "a3a4": 423,
    "a3b4": 424,
    "a3a5": 425,
    "a3c5": 426,
    "a3a6": 427,
    "a3d6": 428,
    "a3a7": 429,
    "a3e7": 430,
    "a3a8": 431,
    "a3f8": 432,
    "a3b1": 433,
    "a3c2": 434,
    "a3c4": 435,
    "a3b5": 436,
    "b3b1": 437,
    "b3d1": 438,
    "b3a2": 439,
    "b3b2": 440,
    "b3c2": 441,
    "b3a3": 442,
    "b3c3": 443,
    "b3d3": 444,
    "b3e3": 445,
    "b3f3": 446,
    "b3g3": 447,
    "b3h3": 448,
    "b3a4": 449,
    "b3b4": 450,
    "b3c4": 451,
    "b3b5": 452,
    "b3d5": 453,
    "b3b6": 454,
    "b3e6": 455,
    "b3b7": 456,
    "b3f7": 457,
    "b3b8": 458,
    "b3g8": 459,
    "b3a1": 460,
    "b3c1": 461,
    "b3d2": 462,
    "b3d4": 463,
    "b3a5": 464,
    "b3c5": 465,
    "c3a1": 466,
    "c3c1": 467,
    "c3e1": 468,
    "c3b2": 469,
    "c3c2": 470,
    "c3d2": 471,
    "c3a3": 472,
    "c3b3": 473,
    "c3d3": 474,
    "c3e3": 475,
    "c3f3": 476,
    "c3g3": 477,
    "c3h3": 478,
    "c3b4": 479,
    "c3c4": 480,
    "c3d4": 481,
    "c3a5": 482,
    "c3c5": 483,
    "c3e5": 484,
    "c3c6": 485,
    "c3f6": 486,
    "c3c7": 487,
    "c3g7": 488,
    "c3c8": 489,
    "c3h8": 490,
    "c3b1": 491,
    "c3d1": 492,
    "c3a2": 493,
    "c3e2": 494,
    "c3a4": 495,
    "c3e4": 496,
    "c3b5": 497,
    "c3d5": 498,
    "d3b1": 499,
    "d3d1": 500,
    "d3f1": 501,
    "d3c2": 502,
    "d3d2": 503,
    "d3e2": 504,
    "d3a3": 505,
    "d3b3": 506,
    "d3c3": 507,
    "d3e3": 508,
    "d3f3": 509,
    "d3g3": 510,
    "d3h3": 511,
    "d3c4": 512,
    "d3d4": 513,
    "d3e4": 514,
    "d3b5": 515,
    "d3d5": 516,
    "d3f5": 517,
    "d3a6": 518,
    "d3d6": 519,
    "d3g6": 520,
    "d3d7": 521,
    "d3h7": 522,
    "d3d8": 523,
    "d3c1": 524,
    "d3e1": 525,
    "d3b2": 526,
    "d3f2": 527,
    "d3b4": 528,
    "d3f4": 529,
    "d3c5": 530,
    "d3e5": 531,
    "e3c1": 532,
    "e3e1": 533,
    "e3g1": 534,
    "e3d2": 535,
    "e3e2": 536,
    "e3f2": 537,
    "e3a3": 538,
    "e3b3": 539,
    "e3c3": 540,
    "e3d3": 541,
    "e3f3": 542,
    "e3g3": 543,
    "e3h3": 544,
    "e3d4": 545,
    "e3e4": 546,
    "e3f4": 547,
    "e3c5": 548,
    "e3e5": 549,
    "e3g5": 550,
    "e3b6": 551,
    "e3e6": 552,
    "e3h6": 553,
    "e3a7": 554,
    "e3e7": 555,
    "e3e8": 556,
    "e3d1": 557,
    "e3f1": 558,
    "e3c2": 559,
    "e3g2": 560,
    "e3c4": 561,
    "e3g4": 562,
    "e3d5": 563,
    "e3f5": 564,
    "f3d1": 565,
    "f3f1": 566,
    "f3h1": 567,
    "f3e2": 568,
    "f3f2": 569,
    "f3g2": 570,
    "f3a3": 571,
    "f3b3": 572,
    "f3c3": 573,
    "f3d3": 574,
    "f3e3": 575,
    "f3g3": 576,
    "f3h3": 577,
    "f3e4": 578,
    "f3f4": 579,
    "f3g4": 580,
    "f3d5": 581,
    "f3f5": 582,
    "f3h5": 583,
    "f3c6": 584,
    "f3f6": 585,
    "f3b7": 586,
    "f3f7": 587,
    "f3a8": 588,
    "f3f8": 589,
    "f3e1": 590,
    "f3g1": 591,
    "f3d2": 592,
    "f3h2": 593,
    "f3d4": 594,
    "f3h4": 595,
    "f3e5": 596,
    "f3g5": 597,
    "g3e1": 598,
    "g3g1": 599,
    "g3f2": 600,
    "g3g2": 601,
    "g3h2": 602,
    "g3a3": 603,
    "g3b3": 604,
    "g3c3": 605,
    "g3d3": 606,
    "g3e3": 607,
    "g3f3": 608,
    "g3h3": 609,
    "g3f4": 610,
    "g3g4": 611,
    "g3h4": 612,
    "g3e5": 613,
    "g3g5": 614,
    "g3d6": 615,
    "g3g6": 616,
    "g3c7": 617,
    "g3g7": 618,
    "g3b8": 619,
    "g3g8": 620,
    "g3f1": 621,
    "g3h1": 622,
    "g3e2": 623,
    "g3e4": 624,
    "g3f5": 625,
    "g3h5": 626,
    "h3f1": 627,
    "h3h1": 628,
    "h3g2": 629,
    "h3h2": 630,
    "h3a3": 631,
    "h3b3": 632,
    "h3c3": 633,
    "h3d3": 634,
    "h3e3": 635,
    "h3f3": 636,
    "h3g3": 637,
    "h3g4": 638,
    "h3h4": 639,
    "h3f5": 640,
    "h3h5": 641,
    "h3e6": 642,
    "h3h6": 643,
    "h3d7": 644,
    "h3h7": 645,
    "h3c8": 646,
    "h3h8": 647,
    "h3g1": 648,
    "h3f2": 649,
    "h3f4": 650,
    "h3g5": 651,
    "a4a1": 652,
    "a4d1": 653,
    "a4a2": 654,
    "a4c2": 655,
    "a4a3": 656,
    "a4b3": 657,
    "a4b4": 658,
    "a4c4": 659,
    "a4d4": 660,
    "a4e4": 661,
    "a4f4": 662,
    "a4g4": 663,
    "a4h4": 664,
    "a4a5": 665,
    "a4b5": 666,
    "a4a6": 667,
    "a4c6": 668,
    "a4a7": 669,
    "a4d7": 670,
    "a4a8": 671,
    "a4e8": 672,
    "a4b2": 673,
    "a4c3": 674,
    "a4c5": 675,
    "a4b6": 676,
    "b4b1": 677,
    "b4e1": 678,
    "b4b2": 679,
    "b4d2": 680,
    "b4a3": 681,
    "b4b3": 682,
    "b4c3": 683,
    "b4a4": 684,
    "b4c4": 685,
    "b4d4": 686,
    "b4e4": 687,
    "b4f4": 688,
    "b4g4": 689,
    "b4h4": 690,
    "b4a5": 691,
    "b4b5": 692,
    "b4c5": 693,
    "b4b6": 694,
    "b4d6": 695,
    "b4b7": 696,
    "b4e7": 697,
    "b4b8": 698,
    "b4f8": 699,
    "b4a2": 700,
    "b4c2": 701,
    "b4d3": 702,
    "b4d5": 703,
    "b4a6": 704,
    "b4c6": 705,
    "c4c1": 706,
    "c4f1": 707,
    "c4a2": 708,
    "c4c2": 709,
    "c4e2": 710,
    "c4b3": 711,
    "c4c3": 712,
    "c4d3": 713,
    "c4a4": 714,
    "c4b4": 715,
    "c4d4": 716,
    "c4e4": 717,
    "c4f4": 718,
    "c4g4": 719,
    "c4h4": 720,
    "c4b5": 721,
    "c4c5": 722,
    "c4d5": 723,
    "c4a6": 724,
    "c4c6": 725,
    "c4e6": 726,
    "c4c7": 727,
    "c4f7": 728,
    "c4c8": 729,
    "c4g8": 730,
    "c4b2": 731,
    "c4d2": 732,
    "c4a3": 733,
    "c4e3": 734,
    "c4a5": 735,
    "c4e5": 736,
    "c4b6": 737,
    "c4d6": 738,
    "d4a1": 739,
    "d4d1": 740,
    "d4g1": 741,
    "d4b2": 742,
    "d4d2": 743,
    "d4f2": 744,
    "d4c3": 745,
    "d4d3": 746,
    "d4e3": 747,
    "d4a4": 748,
    "d4b4": 749,
    "d4c4": 750,
    "d4e4": 751,
    "d4f4": 752,
    "d4g4": 753,
    "d4h4": 754,
    "d4c5": 755,
    "d4d5": 756,
    "d4e5": 757,
    "d4b6": 758,
    "d4d6": 759,
    "d4f6": 760,
    "d4a7": 761,
    "d4d7": 762,
    "d4g7": 763,
    "d4d8": 764,
    "d4h8": 765,
    "d4c2": 766,
    "d4e2": 767,
    "d4b3": 768,
    "d4f3": 769,
    "d4b5": 770,
    "d4f5": 771,
    "d4c6": 772,
    "d4e6": 773,
    "e4b1": 774,
    "e4e1": 775,
    "e4h1": 776,
    "e4c2": 777,
    "e4e2": 778,
    "e4g2": 779,
    "e4d3": 780,
    "e4e3": 781,
    "e4f3": 782,
    "e4a4": 783,
    "e4b4": 784,
    "e4c4": 785,
    "e4d4": 786,
    "e4f4": 787,
    "e4g4": 788,
    "e4h4": 789,
    "e4d5": 790,
    "e4e5": 791,
    "e4f5": 792,
    "e4c6": 793,
    "e4e6": 794,
    "e4g6": 795,
    "e4b7": 796,
    "e4e7": 797,
    "e4h7": 798,
    "e4a8": 799,
    "e4e8": 800,
    "e4d2": 801,
    "e4f2": 802,
    "e4c3": 803,
    "e4g3": 804,
    "e4c5": 805,
    "e4g5": 806,
    "e4d6": 807,
    "e4f6": 808,
    "f4c1": 809,
    "f4f1": 810,
    "f4d2": 811,
    "f4f2": 812,
    "f4h2": 813,
    "f4e3": 814,
    "f4f3": 815,
    "f4g3": 816,
    "f4a4": 817,
    "f4b4": 818,
    "f4c4": 819,
    "f4d4": 820,
    "f4e4": 821,
    "f4g4": 822,
    "f4h4": 823,
    "f4e5": 824,
    "f4f5": 825,
    "f4g5": 826,
    "f4d6": 827,
    "f4f6": 828,
    "f4h6": 829,
    "f4c7": 830,
    "f4f7": 831,
    "f4b8": 832,
    "f4f8": 833,
    "f4e2": 834,
    "f4g2": 835,
    "f4d3": 836,
    "f4h3": 837,
    "f4d5": 838,
    "f4h5": 839,
    "f4e6": 840,
    "f4g6": 841,
    "g4d1": 842,
    "g4g1": 843,
    "g4e2": 844,
    "g4g2": 845,
    "g4f3": 846,
    "g4g3": 847,
    "g4h3": 848,
    "g4a4": 849,
    "g4b4": 850,
    "g4c4": 851,
    "g4d4": 852,
    "g4e4": 853,
    "g4f4": 854,
    "g4h4": 855,
    "g4f5": 856,
    "g4g5": 857,
    "g4h5": 858,
    "g4e6": 859,
    "g4g6": 860,
    "g4d7": 861,
    "g4g7": 862,
    "g4c8": 863,
    "g4g8": 864,
    "g4f2": 865,
    "g4h2": 866,
    "g4e3": 867,
    "g4e5": 868,
    "g4f6": 869,
    "g4h6": 870,
    "h4e1": 871,
    "h4h1": 872,
    "h4f2": 873,
    "h4h2": 874,
    "h4g3": 875,
    "h4h3": 876,
    "h4a4": 877,
    "h4b4": 878,
    "h4c4": 879,
    "h4d4": 880,
    "h4e4": 881,
    "h4f4": 882,
    "h4g4": 883,
    "h4g5": 884,
    "h4h5": 885,
    "h4f6": 886,
    "h4h6": 887,
    "h4e7": 888,
    "h4h7": 889,
    "h4d8": 890,
    "h4h8": 891,
    "h4g2": 892,
    "h4f3": 893,
    "h4f5": 894,
    "h4g6": 895,
    "a5a1": 896,
    "a5e1": 897,
    "a5a2": 898,
    "a5d2": 899,
    "a5a3": 900,
    "a5c3": 901,
    "a5a4": 902,
    "a5b4": 903,
    "a5b5": 904,
    "a5c5": 905,
    "a5d5": 906,
    "a5e5": 907,
    "a5f5": 908,
    "a5g5": 909,
    "a5h5": 910,
    "a5a6": 911,
    "a5b6": 912,
    "a5a7": 913,
    "a5c7": 914,
    "a5a8": 915,
    "a5d8": 916,
    "a5b3": 917,
    "a5c4": 918,
    "a5c6": 919,
    "a5b7": 920,
    "b5b1": 921,
    "b5f1": 922,
    "b5b2": 923,
    "b5e2": 924,
    "b5b3": 925,
    "b5d3": 926,
    "b5a4": 927,
    "b5b4": 928,
    "b5c4": 929,
    "b5a5": 930,
    "b5c5": 931,
    "b5d5": 932,
    "b5e5": 933,
    "b5f5": 934,
    "b5g5": 935,
    "b5h5": 936,
    "b5a6": 937,
    "b5b6": 938,
    "b5c6": 939,
    "b5b7": 940,
    "b5d7": 941,
    "b5b8": 942,
    "b5e8": 943,
    "b5a3": 944,
    "b5c3": 945,
    "b5d4": 946,
    "b5d6": 947,
    "b5a7": 948,
    "b5c7": 949,
    "c5c1": 950,
    "c5g1": 951,
    "c5c2": 952,
    "c5f2": 953,
    "c5a3": 954,
    "c5c3": 955,
    "c5e3": 956,
    "c5b4": 957,
    "c5c4": 958,
    "c5d4": 959,
    "c5a5": 960,
    "c5b5": 961,
    "c5d5": 962,
    "c5e5": 963,
    "c5f5": 964,
    "c5g5": 965,
    "c5h5": 966,
    "c5b6": 967,
    "c5c6": 968,
    "c5d6": 969,
    "c5a7": 970,
    "c5c7": 971,
    "c5e7": 972,
    "c5c8": 973,
    "c5f8": 974,
    "c5b3": 975,
    "c5d3": 976,
    "c5a4": 977,
    "c5e4": 978,
    "c5a6": 979,
    "c5e6": 980,
    "c5b7": 981,
    "c5d7": 982,
    "d5d1": 983,
    "d5h1": 984,
    "d5a2": 985,
    "d5d2": 986,
    "d5g2": 987,
    "d5b3": 988,
    "d5d3": 989,
    "d5f3": 990,
    "d5c4": 991,
    "d5d4": 992,
    "d5e4": 993,
    "d5a5": 994,
    "d5b5": 995,
    "d5c5": 996,
    "d5e5": 997,
    "d5f5": 998,
    "d5g5": 999,
    "d5h5": 1000,
    "d5c6": 1001,
    "d5d6": 1002,
    "d5e6": 1003,
    "d5b7": 1004,
    "d5d7": 1005,
    "d5f7": 1006,
    "d5a8": 1007,
    "d5d8": 1008,
    "d5g8": 1009,
    "d5c3": 1010,
    "d5e3": 1011,
    "d5b4": 1012,
    "d5f4": 1013,
    "d5b6": 1014,
    "d5f6": 1015,
    "d5c7": 1016,
    "d5e7": 1017,
    "e5a1": 1018,
    "e5e1": 1019,
    "e5b2": 1020,
    "e5e2": 1021,
    "e5h2": 1022,
    "e5c3": 1023,
    "e5e3": 1024,
    "e5g3": 1025,
    "e5d4": 1026,
    "e5e4": 1027,
    "e5f4": 1028,
    "e5a5": 1029,
    "e5b5": 1030,
    "e5c5": 1031,
    "e5d5": 1032,
    "e5f5": 1033,
    "e5g5": 1034,
    "e5h5": 1035,
    "e5d6": 1036,
    "e5e6": 1037,
    "e5f6": 1038,
    "e5c7": 1039,
    "e5e7": 1040,
    "e5g7": 1041,
    "e5b8": 1042,
    "e5e8": 1043,
    "e5h8": 1044,
    "e5d3": 1045,
    "e5f3": 1046,
    "e5c4": 1047,
    "e5g4": 1048,
    "e5c6": 1049,
    "e5g6": 1050,
    "e5d7": 1051,
    "e5f7": 1052,
    "f5b1": 1053,
    "f5f1": 1054,
    "f5c2": 1055,
    "f5f2": 1056,
    "f5d3": 1057,
    "f5f3": 1058,
    "f5h3": 1059,
    "f5e4": 1060,
    "f5f4": 1061,
    "f5g4": 1062,
    "f5a5": 1063,
    "f5b5": 1064,
    "f5c5": 1065,
    "f5d5": 1066,
    "f5e5": 1067,
    "f5g5": 1068,
    "f5h5": 1069,
    "f5e6": 1070,
    "f5f6": 1071,
    "f5g6": 1072,
    "f5d7": 1073,
    "f5f7": 1074,
    "f5h7": 1075,
    "f5c8": 1076,
    "f5f8": 1077,
    "f5e3": 1078,
    "f5g3": 1079,
    "f5d4": 1080,
    "f5h4": 1081,
    "f5d6": 1082,
    "f5h6": 1083,
    "f5e7": 1084,
    "f5g7": 1085,
    "g5c1": 1086,
    "g5g1": 1087,
    "g5d2": 1088,
    "g5g2": 1089,
    "g5e3": 1090,
    "g5g3": 1091,
    "g5f4": 1092,
    "g5g4": 1093,
    "g5h4": 1094,
    "g5a5": 1095,
    "g5b5": 1096,
    "g5c5": 1097,
    "g5d5": 1098,
    "g5e5": 1099,
    "g5f5": 1100,
    "g5h5": 1101,
    "g5f6": 1102,
    "g5g6": 1103,
    "g5h6": 1104,
    "g5e7": 1105,
    "g5g7": 1106,
    "g5d8": 1107,
    "g5g8": 1108,
    "g5f3": 1109,
    "g5h3": 1110,
    "g5e4": 1111,
    "g5e6": 1112,
    "g5f7": 1113,
    "g5h7": 1114,
    "h5d1": 1115,
    "h5h1": 1116,
    "h5e2": 1117,
    "h5h2": 1118,
    "h5f3": 1119,
    "h5h3": 1120,
    "h5g4": 1121,
    "h5h4": 1122,
    "h5a5": 1123,
    "h5b5": 1124,
    "h5c5": 1125,
    "h5d5": 1126,
    "h5e5": 1127,
    "h5f5": 1128,
    "h5g5": 1129,
    "h5g6": 1130,
    "h5h6": 1131,
    "h5f7": 1132,
    "h5h7": 1133,
    "h5e8": 1134,
    "h5h8": 1135,
    "h5g3": 1136,
    "h5f4": 1137,
    "h5f6": 1138,
    "h5g7": 1139,
    "a6a1": 1140,
    "a6f1": 1141,
    "a6a2": 1142,
    "a6e2": 1143,
    "a6a3": 1144,
    "a6d3": 1145,
    "a6a4": 1146,
    "a6c4": 1147,
    "a6a5": 1148,
    "a6b5": 1149,
    "a6b6": 1150,
    "a6c6": 1151,
    "a6d6": 1152,
    "a6e6": 1153,
    "a6f6": 1154,
    "a6g6": 1155,
    "a6h6": 1156,
    "a6a7": 1157,
    "a6b7": 1158,
    "a6a8": 1159,
    "a6c8": 1160,
    "a6b4": 1161,
    "a6c5": 1162,
    "a6c7": 1163,
    "a6b8": 1164,
    "b6b1": 1165,
    "b6g1": 1166,
    "b6b2": 1167,
    "b6f2": 1168,
    "b6b3": 1169,
    "b6e3": 1170,
    "b6b4": 1171,
    "b6d4": 1172,
    "b6a5": 1173,
    "b6b5": 1174,
    "b6c5": 1175,
    "b6a6": 1176,
    "b6c6": 1177,
    "b6d6": 1178,
    "b6e6": 1179,
    "b6f6": 1180,
    "b6g6": 1181,
    "b6h6": 1182,
    "b6a7": 1183,
    "b6b7": 1184,
    "b6c7": 1185,
    "b6b8": 1186,
    "b6d8": 1187,
    "b6a4": 1188,
    "b6c4": 1189,
    "b6d5": 1190,
    "b6d7": 1191,
    "b6a8": 1192,
    "b6c8": 1193,
    "c6c1": 1194,
    "c6h1": 1195,
    "c6c2": 1196,
    "c6g2": 1197,
    "c6c3": 1198,
    "c6f3": 1199,
    "c6a4": 1200,
    "c6c4": 1201,
    "c6e4": 1202,
    "c6b5": 1203,
    "c6c5": 1204,
    "c6d5": 1205,
    "c6a6": 1206,
    "c6b6": 1207,
    "c6d6": 1208,
    "c6e6": 1209,
    "c6f6": 1210,
    "c6g6": 1211,
    "c6h6": 1212,
    "c6b7": 1213,
    "c6c7": 1214,
    "c6d7": 1215,
    "c6a8": 1216,
    "c6c8": 1217,
    "c6e8": 1218,
    "c6b4": 1219,
    "c6d4": 1220,
    "c6a5": 1221,
    "c6e5": 1222,
    "c6a7": 1223,
    "c6e7": 1224,
    "c6b8": 1225,
    "c6d8": 1226,
    "d6d1": 1227,
    "d6d2": 1228,
    "d6h2": 1229,
    "d6a3": 1230,
    "d6d3": 1231,
    "d6g3": 1232,
    "d6b4": 1233,
    "d6d4": 1234,
    "d6f4": 1235,
    "d6c5": 1236,
    "d6d5": 1237,
    "d6e5": 1238,
    "d6a6": 1239,
    "d6b6": 1240,
    "d6c6": 1241,
    "d6e6": 1242,
    "d6f6": 1243,
    "d6g6": 1244,
    "d6h6": 1245,
    "d6c7": 1246,
    "d6d7": 1247,
    "d6e7": 1248,
    "d6b8": 1249,
    "d6d8": 1250,
    "d6f8": 1251,
    "d6c4": 1252,
    "d6e4": 1253,
    "d6b5": 1254,
    "d6f5": 1255,
    "d6b7": 1256,
    "d6f7": 1257,
    "d6c8": 1258,
    "d6e8": 1259,
    "e6e1": 1260,
    "e6a2": 1261,
    "e6e2": 1262,
    "e6b3": 1263,
    "e6e3": 1264,
    "e6h3": 1265,
    "e6c4": 1266,
    "e6e4": 1267,
    "e6g4": 1268,
    "e6d5": 1269,
    "e6e5": 1270,
    "e6f5": 1271,
    "e6a6": 1272,
    "e6b6": 1273,
    "e6c6": 1274,
    "e6d6": 1275,
    "e6f6": 1276,
    "e6g6": 1277,
    "e6h6": 1278,
    "e6d7": 1279,
    "e6e7": 1280,
    "e6f7": 1281,
    "e6c8": 1282,
    "e6e8": 1283,
    "e6g8": 1284,
    "e6d4": 1285,
    "e6f4": 1286,
    "e6c5": 1287,
    "e6g5": 1288,
    "e6c7": 1289,
    "e6g7": 1290,
    "e6d8": 1291,
    "e6f8": 1292,
    "f6a1": 1293,
    "f6f1": 1294,
    "f6b2": 1295,
    "f6f2": 1296,
    "f6c3": 1297,
    "f6f3": 1298,
    "f6d4": 1299,
    "f6f4": 1300,
    "f6h4": 1301,
    "f6e5": 1302,
    "f6f5": 1303,
    "f6g5": 1304,
    "f6a6": 1305,
    "f6b6": 1306,
    "f6c6": 1307,
    "f6d6": 1308,
    "f6e6": 1309,
    "f6g6": 1310,
    "f6h6": 1311,
    "f6e7": 1312,
    "f6f7": 1313,
    "f6g7": 1314,
    "f6d8": 1315,
    "f6f8": 1316,
    "f6h8": 1317,
    "f6e4": 1318,
    "f6g4": 1319,
    "f6d5": 1320,
    "f6h5": 1321,
    "f6d7": 1322,
    "f6h7": 1323,
    "f6e8": 1324,
    "f6g8": 1325,
    "g6b1": 1326,
    "g6g1": 1327,
    "g6c2": 1328,
    "g6g2": 1329,
    "g6d3": 1330,
    "g6g3": 1331,
    "g6e4": 1332,
    "g6g4": 1333,
    "g6f5": 1334,
    "g6g5": 1335,
    "g6h5": 1336,
    "g6a6": 1337,
    "g6b6": 1338,
    "g6c6": 1339,
    "g6d6": 1340,
    "g6e6": 1341,
    "g6f6": 1342,
    "g6h6": 1343,
    "g6f7": 1344,
    "g6g7": 1345,
    "g6h7": 1346,
    "g6e8": 1347,
    "g6g8": 1348,
    "g6f4": 1349,
    "g6h4": 1350,
    "g6e5": 1351,
    "g6e7": 1352,
    "g6f8": 1353,
    "g6h8": 1354,
    "h6c1": 1355,
    "h6h1": 1356,
    "h6d2": 1357,
    "h6h2": 1358,
    "h6e3": 1359,
    "h6h3": 1360,
    "h6f4": 1361,
    "h6h4": 1362,
    "h6g5": 1363,
    "h6h5": 1364,
    "h6a6": 1365,
    "h6b6": 1366,
    "h6c6": 1367,
    "h6d6": 1368,
    "h6e6": 1369,
    "h6f6": 1370,
    "h6g6": 1371,
    "h6g7": 1372,
    "h6h7": 1373,
    "h6f8": 1374,
    "h6h8": 1375,
    "h6g4": 1376,
    "h6f5": 1377,
    "h6f7": 1378,
    "h6g8": 1379,
    "a7a1": 1380,
    "a7g1": 1381,
    "a7a2": 1382,
    "a7f2": 1383,
    "a7a3": 1384,
    "a7e3": 1385,
    "a7a4": 1386,
    "a7d4": 1387,
    "a7a5": 1388,
    "a7c5": 1389,
    "a7a6": 1390,
    "a7b6": 1391,
    "a7b7": 1392,
    "a7c7": 1393,
    "a7d7": 1394,
    "a7e7": 1395,
    "a7f7": 1396,
    "a7g7": 1397,
    "a7h7": 1398,
    "a7a8": 1399,
    "a7b8": 1400,
    "a7b5": 1401,
    "a7c6": 1402,
    "a7c8": 1403,
    "b7b1": 1404,
    "b7h1": 1405,
    "b7b2": 1406,
    "b7g2": 1407,
    "b7b3": 1408,
    "b7f3": 1409,
    "b7b4": 1410,
    "b7e4": 1411,
    "b7b5": 1412,
    "b7d5": 1413,
    "b7a6": 1414,
    "b7b6": 1415,
    "b7c6": 1416,
    "b7a7": 1417,
    "b7c7": 1418,
    "b7d7": 1419,
    "b7e7": 1420,
    "b7f7": 1421,
    "b7g7": 1422,
    "b7h7": 1423,
    "b7a8": 1424,
    "b7b8": 1425,
    "b7c8": 1426,
    "b7a5": 1427,
    "b7c5": 1428,
    "b7d6": 1429,
    "b7d8": 1430,
    "c7c1": 1431,
    "c7c2": 1432,
    "c7h2": 1433,
    "c7c3": 1434,
    "c7g3": 1435,
    "c7c4": 1436,
    "c7f4": 1437,
    "c7a5": 1438,
    "c7c5": 1439,
    "c7e5": 1440,
    "c7b6": 1441,
    "c7c6": 1442,
    "c7d6": 1443,
    "c7a7": 1444,
    "c7b7": 1445,
    "c7d7": 1446,
    "c7e7": 1447,
    "c7f7": 1448,
    "c7g7": 1449,
    "c7h7": 1450,
    "c7b8": 1451,
    "c7c8": 1452,
    "c7d8": 1453,
    "c7b5": 1454,
    "c7d5": 1455,
    "c7a6": 1456,
    "c7e6": 1457,
    "c7a8": 1458,
    "c7e8": 1459,
    "d7d1": 1460,
    "d7d2": 1461,
    "d7d3": 1462,
    "d7h3": 1463,
    "d7a4": 1464,
    "d7d4": 1465,
    "d7g4": 1466,
    "d7b5": 1467,
    "d7d5": 1468,
    "d7f5": 1469,
    "d7c6": 1470,
    "d7d6": 1471,
    "d7e6": 1472,
    "d7a7": 1473,
    "d7b7": 1474,
    "d7c7": 1475,
    "d7e7": 1476,
    "d7f7": 1477,
    "d7g7": 1478,
    "d7h7": 1479,
    "d7c8": 1480,
    "d7d8": 1481,
    "d7e8": 1482,
    "d7c5": 1483,
    "d7e5": 1484,
    "d7b6": 1485,
    "d7f6": 1486,
    "d7b8": 1487,
    "d7f8": 1488,
    "e7e1": 1489,
    "e7e2": 1490,
    "e7a3": 1491,
    "e7e3": 1492,
    "e7b4": 1493,
    "e7e4": 1494,
    "e7h4": 1495,
    "e7c5": 1496,
    "e7e5": 1497,
    "e7g5": 1498,
    "e7d6": 1499,
    "e7e6": 1500,
    "e7f6": 1501,
    "e7a7": 1502,
    "e7b7": 1503,
    "e7c7": 1504,
    "e7d7": 1505,
    "e7f7": 1506,
    "e7g7": 1507,
    "e7h7": 1508,
    "e7d8": 1509,
    "e7e8": 1510,
    "e7f8": 1511,
    "e7d5": 1512,
    "e7f5": 1513,
    "e7c6": 1514,
    "e7g6": 1515,
    "e7c8": 1516,
    "e7g8": 1517,
    "f7f1": 1518,
    "f7a2": 1519,
    "f7f2": 1520,
    "f7b3": 1521,
    "f7f3": 1522,
    "f7c4": 1523,
    "f7f4": 1524,
    "f7d5": 1525,
    "f7f5": 1526,
    "f7h5": 1527,
    "f7e6": 1528,
    "f7f6": 1529,
    "f7g6": 1530,
    "f7a7": 1531,
    "f7b7": 1532,
    "f7c7": 1533,
    "f7d7": 1534,
    "f7e7": 1535,
    "f7g7": 1536,
    "f7h7": 1537,
    "f7e8": 1538,
    "f7f8": 1539,
    "f7g8": 1540,
    "f7e5": 1541,
    "f7g5": 1542,
    "f7d6": 1543,
    "f7h6": 1544,
    "f7d8": 1545,
    "f7h8": 1546,
    "g7a1": 1547,
    "g7g1": 1548,
    "g7b2": 1549,
    "g7g2": 1550,
    "g7c3": 1551,
    "g7g3": 1552,
    "g7d4": 1553,
    "g7g4": 1554,
    "g7e5": 1555,
    "g7g5": 1556,
    "g7f6": 1557,
    "g7g6": 1558,
    "g7h6": 1559,
    "g7a7": 1560,
    "g7b7": 1561,
    "g7c7": 1562,
    "g7d7": 1563,
    "g7e7": 1564,
    "g7f7": 1565,
    "g7h7": 1566,
    "g7f8": 1567,
    "g7g8": 1568,
    "g7h8": 1569,
    "g7f5": 1570,
    "g7h5": 1571,
    "g7e6": 1572,
    "g7e8": 1573,
    "h7b1": 1574,
    "h7h1": 1575,
    "h7c2": 1576,
    "h7h2": 1577,
    "h7d3": 1578,
    "h7h3": 1579,
    "h7e4": 1580,
    "h7h4": 1581,
    "h7f5": 1582,
    "h7h5": 1583,
    "h7g6": 1584,
    "h7h6": 1585,
    "h7a7": 1586,
    "h7b7": 1587,
    "h7c7": 1588,
    "h7d7": 1589,
    "h7e7": 1590,
    "h7f7": 1591,
    "h7g7": 1592,
    "h7g8": 1593,
    "h7h8": 1594,
    "h7g5": 1595,
    "h7f6": 1596,
    "h7f8": 1597,
    "a8a1": 1598,
    "a8h1": 1599,
    "a8a2": 1600,
    "a8g2": 1601,
    "a8a3": 1602,
    "a8f3": 1603,
    "a8a4": 1604,
    "a8e4": 1605,
    "a8a5": 1606,
    "a8d5": 1607,
    "a8a6": 1608,
    "a8c6": 1609,
    "a8a7": 1610,
    "a8b7": 1611,
    "a8b8": 1612,
    "a8c8": 1613,
    "a8d8": 1614,
    "a8e8": 1615,
    "a8f8": 1616,
    "a8g8": 1617,
    "a8h8": 1618,
    "a8b6": 1619,
    "a8c7": 1620,
    "b8b1": 1621,
    "b8b2": 1622,
    "b8h2": 1623,
    "b8b3": 1624,
    "b8g3": 1625,
    "b8b4": 1626,
    "b8f4": 1627,
    "b8b5": 1628,
    "b8e5": 1629,
    "b8b6": 1630,
    "b8d6": 1631,
    "b8a7": 1632,
    "b8b7": 1633,
    "b8c7": 1634,
    "b8a8": 1635,
    "b8c8": 1636,
    "b8d8": 1637,
    "b8e8": 1638,
    "b8f8": 1639,
    "b8g8": 1640,
    "b8h8": 1641,
    "b8a6": 1642,
    "b8c6": 1643,
    "b8d7": 1644,
    "c8c1": 1645,
    "c8c2": 1646,
    "c8c3": 1647,
    "c8h3": 1648,
    "c8c4": 1649,
    "c8g4": 1650,
    "c8c5": 1651,
    "c8f5": 1652,
    "c8a6": 1653,
    "c8c6": 1654,
    "c8e6": 1655,
    "c8b7": 1656,
    "c8c7": 1657,
    "c8d7": 1658,
    "c8a8": 1659,
    "c8b8": 1660,
    "c8d8": 1661,
    "c8e8": 1662,
    "c8f8": 1663,
    "c8g8": 1664,
    "c8h8": 1665,
    "c8b6": 1666,
    "c8d6": 1667,
    "c8a7": 1668,
    "c8e7": 1669,
    "d8d1": 1670,
    "d8d2": 1671,
    "d8d3": 1672,
    "d8d4": 1673,
    "d8h4": 1674,
    "d8a5": 1675,
    "d8d5": 1676,
    "d8g5": 1677,
    "d8b6": 1678,
    "d8d6": 1679,
    "d8f6": 1680,
    "d8c7": 1681,
    "d8d7": 1682,
    "d8e7": 1683,
    "d8a8": 1684,
    "d8b8": 1685,
    "d8c8": 1686,
    "d8e8": 1687,
    "d8f8": 1688,
    "d8g8": 1689,
    "d8h8": 1690,
    "d8c6": 1691,
    "d8e6": 1692,
    "d8b7": 1693,
    "d8f7": 1694,
    "e8e1": 1695,
    "e8e2": 1696,
    "e8e3": 1697,
    "e8a4": 1698,
    "e8e4": 1699,
    "e8b5": 1700,
    "e8e5": 1701,
    "e8h5": 1702,
    "e8c6": 1703,
    "e8e6": 1704,
    "e8g6": 1705,
    "e8d7": 1706,
    "e8e7": 1707,
    "e8f7": 1708,
    "e8a8": 1709,
    "e8b8": 1710,
    "e8c8": 1711,
    "e8d8": 1712,
    "e8f8": 1713,
    "e8g8": 1714,
    "e8h8": 1715,
    "e8d6": 1716,
    "e8f6": 1717,
    "e8c7": 1718,
    "e8g7": 1719,
    "f8f1": 1720,
    "f8f2": 1721,
    "f8a3": 1722,
    "f8f3": 1723,
    "f8b4": 1724,
    "f8f4": 1725,
    "f8c5": 1726,
    "f8f5": 1727,
    "f8d6": 1728,
    "f8f6": 1729,
    "f8h6": 1730,
    "f8e7": 1731,
    "f8f7": 1732,
    "f8g7": 1733,
    "f8a8": 1734,
    "f8b8": 1735,
    "f8c8": 1736,
    "f8d8": 1737,
    "f8e8": 1738,
    "f8g8": 1739,
    "f8h8": 1740,
    "f8e6": 1741,
    "f8g6": 1742,
    "f8d7": 1743,
    "f8h7": 1744,
    "g8g1": 1745,
    "g8a2": 1746,
    "g8g2": 1747,
    "g8b3": 1748,
    "g8g3": 1749,
    "g8c4": 1750,
    "g8g4": 1751,
    "g8d5": 1752,
    "g8g5": 1753,
    "g8e6": 1754,
    "g8g6": 1755,
    "g8f7": 1756,
    "g8g7": 1757,
    "g8h7": 1758,
    "g8a8": 1759,
    "g8b8": 1760,
    "g8c8": 1761,
    "g8d8": 1762,
    "g8e8": 1763,
    "g8f8": 1764,
    "g8h8": 1765,
    "g8f6": 1766,
    "g8h6": 1767,
    "g8e7": 1768,
    "h8a1": 1769,
    "h8h1": 1770,
    "h8b2": 1771,
    "h8h2": 1772,
    "h8c3": 1773,
    "h8h3": 1774,
    "h8d4": 1775,
    "h8h4": 1776,
    "h8e5": 1777,
    "h8h5": 1778,
    "h8f6": 1779,
    "h8h6": 1780,
    "h8g7": 1781,
    "h8h7": 1782,
    "h8a8": 1783,
    "h8b8": 1784,
    "h8c8": 1785,
    "h8d8": 1786,
    "h8e8": 1787,
    "h8f8": 1788,
    "h8g8": 1789,
    "h8g6": 1790,
    "h8f7": 1791,
    "a2a1q": 1792,
    "a2a1r": 1793,
    "a2a1b": 1794,
    "a2a1n": 1795,
    "a2b1q": 1796,
    "a2b1r": 1797,
    "a2b1b": 1798,
    "a2b1n": 1799,
    "b2b1q": 1800,
    "b2b1r": 1801,
    "b2b1b": 1802,
    "b2b1n": 1803,
    "b2a1q": 1804,
    "b2a1r": 1805,
    "b2a1b": 1806,
    "b2a1n": 1807,
    "b2c1q": 1808,
    "b2c1r": 1809,
    "b2c1b": 1810,
    "b2c1n": 1811,
    "c2c1q": 1812,
    "c2c1r": 1813,
    "c2c1b": 1814,
    "c2c1n": 1815,
    "c2b1q": 1816,
    "c2b1r": 1817,
    "c2b1b": 1818,
    "c2b1n": 1819,
    "c2d1q": 1820,
    "c2d1r": 1821,
    "c2d1b": 1822,
    "c2d1n": 1823,
    "d2d1q": 1824,
    "d2d1r": 1825,
    "d2d1b": 1826,
    "d2d1n": 1827,
    "d2c1q": 1828,
    "d2c1r": 1829,
    "d2c1b": 1830,
    "d2c1n": 1831,
    "d2e1q": 1832,
    "d2e1r": 1833,
    "d2e1b": 1834,
    "d2e1n": 1835,
    "e2e1q": 1836,
    "e2e1r": 1837,
    "e2e1b": 1838,
    "e2e1n": 1839,
    "e2d1q": 1840,
    "e2d1r": 1841,
    "e2d1b": 1842,
    "e2d1n": 1843,
    "e2f1q": 1844,
    "e2f1r": 1845,
    "e2f1b": 1846,
    "e2f1n": 1847,
    "f2f1q": 1848,
    "f2f1r": 1849,
    "f2f1b": 1850,
    "f2f1n": 1851,
    "f2e1q": 1852,
    "f2e1r": 1853,
    "f2e1b": 1854,
    "f2e1n": 1855,
    "f2g1q": 1856,
    "f2g1r": 1857,
    "f2g1b": 1858,
    "f2g1n": 1859,
    "g2g1q": 1860,
    "g2g1r": 1861,
    "g2g1b": 1862,
    "g2g1n": 1863,
    "g2f1q": 1864,
    "g2f1r": 1865,
    "g2f1b": 1866,
    "g2f1n": 1867,
    "g2h1q": 1868,
    "g2h1r": 1869,
    "g2h1b": 1870,
    "g2h1n": 1871,
    "h2h1q": 1872,
    "h2h1r": 1873,
    "h2h1b": 1874,
    "h2h1n": 1875,
    "h2g1q": 1876,
    "h2g1r": 1877,
    "h2g1b": 1878,
    "h2g1n": 1879,
    "a7a8q": 1880,
    "a7a8r": 1881,
    "a7a8b": 1882,
    "a7a8n": 1883,
    "a7b8q": 1884,
    "a7b8r": 1885,
    "a7b8b": 1886,
    "a7b8n": 1887,
    "b7b8q": 1888,
    "b7b8r": 1889,
    "b7b8b": 1890,
    "b7b8n": 1891,
    "b7a8q": 1892,
    "b7a8r": 1893,
    "b7a8b": 1894,
    "b7a8n": 1895,
    "b7c8q": 1896,
    "b7c8r": 1897,
    "b7c8b": 1898,
    "b7c8n": 1899,
    "c7c8q": 1900,
    "c7c8r": 1901,
    "c7c8b": 1902,
    "c7c8n": 1903,
    "c7b8q": 1904,
    "c7b8r": 1905,
    "c7b8b": 1906,
    "c7b8n": 1907,
    "c7d8q": 1908,
    "c7d8r": 1909,
    "c7d8b": 1910,
    "c7d8n": 1911,
    "d7d8q": 1912,
    "d7d8r": 1913,
    "d7d8b": 1914,
    "d7d8n": 1915,
    "d7c8q": 1916,
    "d7c8r": 1917,
    "d7c8b": 1918,
    "d7c8n": 1919,
    "d7e8q": 1920,
    "d7e8r": 1921,
    "d7e8b": 1922,
    "d7e8n": 1923,
    "e7e8q": 1924,
    "e7e8r": 1925,
    "e7e8b": 1926,
    "e7e8n": 1927,
    "e7d8q": 1928,
    "e7d8r": 1929,
    "e7d8b": 1930,
    "e7d8n": 1931,
    "e7f8q": 1932,
    "e7f8r": 1933,
    "e7f8b": 1934,
    "e7f8n": 1935,
    "f7f8q": 1936,
    "f7f8r": 1937,
    "f7f8b": 1938,
    "f7f8n": 1939,
    "f7e8q": 1940,
    "f7e8r": 1941,
    "f7e8b": 1942,
    "f7e8n": 1943,
    "f7g8q": 1944,
    "f7g8r": 1945,
    "f7g8b": 1946,
    "f7g8n": 1947,
    "g7g8q": 1948,
    "g7g8r": 1949,
    "g7g8b": 1950,
    "g7g8n": 1951,
    "g7f8q": 1952,
    "g7f8r": 1953,
    "g7f8b": 1954,
    "g7f8n": 1955,
    "g7h8q": 1956,
    "g7h8r": 1957,
    "g7h8b": 1958,
    "g7h8n": 1959,
    "h7h8q": 1960,
    "h7h8r": 1961,
    "h7h8b": 1962,
    "h7h8n": 1963,
    "h7g8q": 1964,
    "h7g8r": 1965,
    "h7g8b": 1966,
    "h7g8n": 1967
  },
  "action_to_move": {
    "0": "a1b1",
    "1": "a1c1",
    "2": "a1d1",
    "3": "a1e1",
    "4": "a1f1",
    "5": "a1g1",
    "6": "a1h1",
    "7": "a1a2",
    "8": "a1b2",
    "9": "a1a3",
    "10": "a1c3",
    "11": "a1a4",
    "12": "a1d4",
    "13": "a1a5",
    "14": "a1e5",
    "15": "a1a6",
    "16": "a1f6",
    "17": "a1a7",
    "18": "a1g7",
    "19": "a1a8",
    "20": "a1h8",
    "21": "a1c2",
    "22": "a1b3",
    "23": "b1a1",
    "24": "b1c1",
    "25": "b1d1",
    "26": "b1e1",
    "27": "b1f1",
    "28": "b1g1",
    "29": "b1h1",
    "30": "b1a2",
    "31": "b1b2",
    "32": "b1c2",
    "33": "b1b3",
    "34": "b1d3",
    "35": "b1b4",
    "36": "b1e4",
    "37": "b1b5",
    "38": "b1f5",
    "39": "b1b6",
    "40": "b1g6",
    "41": "b1b7",
    "42": "b1h7",
    "43": "b1b8",
    "44": "b1d2",
    "45": "b1a3",
    "46": "b1c3",
    "47": "c1a1",
    "48": "c1b1",
    "49": "c1d1",
    "50": "c1e1",
    "51": "c1f1",
    "52": "c1g1",
    "53": "c1h1",
    "54": "c1b2",
    "55": "c1c2",
    "56": "c1d2",
    "57": "c1a3",
    "58": "c1c3",
    "59": "c1e3",
    "60": "c1c4",
    "61": "c1f4",
    "62": "c1c5",
    "63": "c1g5",
    "64": "c1c6",
    "65": "c1h6",
    "66": "c1c7",
    "67": "c1c8",
    "68": "c1a2",
    "69": "c1e2",
    "70": "c1b3",
    "71": "c1d3",
    "72": "d1a1",
    "73": "d1b1",
    "74": "d1c1",
    "75": "d1e1",
    "76": "d1f1",
    "77": "d1g1",
    "78": "d1h1",
    "79": "d1c2",
    "80": "d1d2",
    "81": "d1e2",
    "82": "d1b3",
    "83": "d1d3",
    "84": "d1f3",
    "85": "d1a4",
    "86": "d1d4",
    "87": "d1g4",
    "88": "d1d5",
    "89": "d1h5",
    "90": "d1d6",
    "91": "d1d7",
    "92": "d1d8",
    "93": "d1b2",
    "94": "d1f2",
    "95": "d1c3",
    "96": "d1e3",
    "97": "e1a1",
    "98": "e1b1",
    "99": "e1c1",
    "100": "e1d1",
    "101": "e1f1",
    "102": "e1g1",
    "103": "e1h1",
    "104": "e1d2",
    "105": "e1e2",
    "106": "e1f2",
    "107": "e1c3",
    "108": "e1e3",
    "109": "e1g3",
    "110": "e1b4",
    "111": "e1e4",
    "112": "e1h4",
    "113": "e1a5",
    "114": "e1e5",
    "115": "e1e6",
    "116": "e1e7",
    "117": "e1e8",
    "118": "e1c2",
    "119": "e1g2",
    "120": "e1d3",
    "121": "e1f3",
    "122": "f1a1",
    "123": "f1b1",
    "124": "f1c1",
    "125": "f1d1",
    "126": "f1e1",
    "127": "f1g1",
    "128": "f1h1",
    "129": "f1e2",
    "130": "f1f2",
    "131": "f1g2",
    "132": "f1d3",
    "133": "f1f3",
    "134": "f1h3",
    "135": "f1c4",
    "136": "f1f4",
    "137": "f1b5",
    "138": "f1f5",
    "139": "f1a6",
    "140": "f1f6",
    "141": "f1f7",
    "142": "f1f8",
    "143": "f1d2",
    "144": "f1h2",
    "145": "f1e3",
    "146": "f1g3",
    "147": "g1a1",
    "148": "g1b1",
    "149": "g1c1",
    "150": "g1d1",
    "151": "g1e1",
    "152": "g1f1",
    "153": "g1h1",
    "154": "g1f2",
    "155": "g1g2",
    "156": "g1h2",
    "157": "g1e3",
    "158": "g1g3",
    "159": "g1d4",
    "160": "g1g4",
    "161": "g1c5",
    "162": "g1g5",
    "163": "g1b6",
    "164": "g1g6",
    "165": "g1a7",
    "166": "g1g7",
    "167": "g1g8",
    "168": "g1e2",
    "169": "g1f3",
    "170": "g1h3",
    "171": "h1a1",
    "172": "h1b1",
    "173": "h1c1",
    "174": "h1d1",
    "175": "h1e1",
    "176": "h1f1",
    "177": "h1g1",
    "178": "h1g2",
    "179": "h1h2",
    "180": "h1f3",
    "181": "h1h3",
    "182": "h1e4",
    "183": "h1h4",
    "184": "h1d5",
    "185": "h1h5",
    "186": "h1c6",
    "187": "h1h6",
    "188": "h1b7",
    "189": "h1h7",
    "190": "h1a8",
    "191": "h1h8",
    "192": "h1f2",
    "193": "h1g3",
    "194": "a2a1",
    "195": "a2b1",
    "196": "a2b2",
    "197": "a2c2",
    "198": "a2d2",
    "199": "a2e2",
    "200": "a2f2",
    "201": "a2g2",
    "202": "a2h2",
    "203": "a2a3",
    "204": "a2b3",
    "205": "a2a4",
    "206": "a2c4",
    "207": "a2a5",
    "208": "a2d5",
    "209": "a2a6",
    "210": "a2e6",
    "211": "a2a7",
    "212": "a2f7",
    "213": "a2a8",
    "214": "a2g8",
    "215": "a2c1",
    "216": "a2c3",
    "217": "a2b4",
    "218": "b2a1",
    "219": "b2b1",
    "220": "b2c1",
    "221": "b2a2",
    "222": "b2c2",
    "223": "b2d2",
    "224": "b2e2",
    "225": "b2f2",
    "226": "b2g2",
    "227": "b2h2",
    "228": "b2a3",
    "229": "b2b3",
    "230": "b2c3",
    "231": "b2b4",
    "232": "b2d4",
    "233": "b2b5",
    "234": "b2e5",
    "235": "b2b6",
    "236": "b2f6",
    "237": "b2b7",
    "238": "b2g7",
    "239": "b2b8",
    "240": "b2h8",
    "241": "b2d1",
    "242": "b2d3",
    "243": "b2a4",
    "244": "b2c4",
    "245": "c2b1",
    "246": "c2c1",
    "247": "c2d1",
    "248": "c2a2",
    "249": "c2b2",
    "250": "c2d2",
    "251": "c2e2",
    "252": "c2f2",
    "253": "c2g2",
    "254": "c2h2",
    "255": "c2b3",
    "256": "c2c3",
    "257": "c2d3",
    "258": "c2a4",
    "259": "c2c4",
    "260": "c2e4",
    "261": "c2c5",
    "262": "c2f5",
    "263": "c2c6",
    "264": "c2g6",
    "265": "c2c7",
    "266": "c2h7",
    "267": "c2c8",
    "268": "c2a1",
    "269": "c2e1",
    "270": "c2a3",
    "271": "c2e3",
    "272": "c2b4",
    "273": "c2d4",
    "274": "d2c1",
    "275": "d2d1",
    "276": "d2e1",
    "277": "d2a2",
    "278": "d2b2",
    "279": "d2c2",
    "280": "d2e2",
    "281": "d2f2",
    "282": "d2g2",
    "283": "d2h2",
    "284": "d2c3",
    "285": "d2d3",
    "286": "d2e3",
    "287": "d2b4",
    "288": "d2d4",
    "289": "d2f4",
    "290": "d2a5",
    "291": "d2d5",
    "292": "d2g5",
    "293": "d2d6",
    "294": "d2h6",
    "295": "d2d7",
    "296": "d2d8",
    "297": "d2b1",
    "298": "d2f1",
    "299": "d2b3",
    "300": "d2f3",
    "301": "d2c4",
    "302": "d2e4",
    "303": "e2d1",
    "304": "e2e1",
    "305": "e2f1",
    "306": "e2a2",
    "307": "e2b2",
    "308": "e2c2",
    "309": "e2d2",
    "310": "e2f2",
    "311": "e2g2",
    "312": "e2h2",
    "313": "e2d3",
    "314": "e2e3",
    "315": "e2f3",
    "316": "e2c4",
    "317": "e2e4",
    "318": "e2g4",
    "319": "e2b5",
    "320": "e2e5",
    "321": "e2h5",
    "322": "e2a6",
    "323": "e2e6",
    "324": "e2e7",
    "325": "e2e8",
    "326": "e2c1",
    "327": "e2g1",
    "328": "e2c3",
    "329": "e2g3",
    "330": "e2d4",
    "331": "e2f4",
    "332": "f2e1",
    "333": "f2f1",
    "334": "f2g1",
    "335": "f2a2",
    "336": "f2b2",
    "337": "f2c2",
    "338": "f2d2",
    "339": "f2e2",
    "340": "f2g2",
    "341": "f2h2",
    "342": "f2e3",
    "343": "f2f3",
    "344": "f2g3",
    "345": "f2d4",
    "346": "f2f4",
    "347": "f2h4",
    "348": "f2c5",
    "349": "f2f5",
    "350": "f2b6",
    "351": "f2f6",
    "352": "f2a7",
    "353": "f2f7",
    "354": "f2f8",
    "355": "f2d1",
    "356": "f2h1",
    "357": "f2d3",
    "358": "f2h3",
    "359": "f2e4",
    "360": "f2g4",
    "361": "g2f1",
    "362": "g2g1",
    "363": "g2h1",
    "364": "g2a2",
    "365": "g2b2",
    "366": "g2c2",
    "367": "g2d2",
    "368": "g2e2",
    "369": "g2f2",
    "370": "g2h2",
    "371": "g2f3",
    "372": "g2g3",
    "373": "g2h3",
    "374": "g2e4",
    "375": "g2g4",
    "376": "g2d5",
    "377": "g2g5",
    "378": "g2c6",
    "379": "g2g6",
    "380": "g2b7",
    "381": "g2g7",
    "382": "g2a8",
    "383": "g2g8",
    "384": "g2e1",
    "385": "g2e3",
    "386": "g2f4",
    "387": "g2h4",
    "388": "h2g1",
    "389": "h2h1",
    "390": "h2a2",
    "391": "h2b2",
    "392": "h2c2",
    "393": "h2d2",
    "394": "h2e2",
    "395": "h2f2",
    "396": "h2g2",
    "397": "h2g3",
    "398": "h2h3",
    "399": "h2f4",
    "400": "h2h4",
    "401": "h2e5",
    "402": "h2h5",
    "403": "h2d6",
    "404": "h2h6",
    "405": "h2c7",
    "406": "h2h7",
    "407": "h2b8",
    "408": "h2h8",
    "409": "h2f1",
    "410": "h2f3",
    "411": "h2g4",
    "412": "a3a1",
    "413": "a3c1",
    "414": "a3a2",
    "415": "a3b2",
    "416": "a3b3",
    "417": "a3c3",
    "418": "a3d3",
    "419": "a3e3",
    "420": "a3f3",
    "421": "a3g3",
    "422": "a3h3",
    "423": "a3a4",
    "424": "a3b4",
    "425": "a3a5",
    "426": "a3c5",
    "427": "a3a6",
    "428": "a3d6",
    "429": "a3a7",
    "430": "a3e7",
    "431": "a3a8",
    "432": "a3f8",
    "433": "a3b1",
    "434": "a3c2",
    "435": "a3c4",
    "436": "a3b5",
    "437": "b3b1",
    "438": "b3d1",
    "439": "b3a2",
    "440": "b3b2",
    "441": "b3c2",
    "442": "b3a3",
    "443": "b3c3",
    "444": "b3d3",
    "445": "b3e3",
    "446": "b3f3",
    "447": "b3g3",
    "448": "b3h3",
    "449": "b3a4",
    "450": "b3b4",
    "451": "b3c4",
    "452": "b3b5",
    "453": "b3d5",
    "454": "b3b6",
    "455": "b3e6",
    "456": "b3b7",
    "457": "b3f7",
    "458": "b3b8",
    "459": "b3g8",
    "460": "b3a1",
    "461": "b3c1",
    "462": "b3d2",
    "463": "b3d4",
    "464": "b3a5",
    "465": "b3c5",
    "466": "c3a1",
    "467": "c3c1",
    "468": "c3e1",
    "469": "c3b2",
    "470": "c3c2",
    "471": "c3d2",
    "472": "c3a3",
    "473": "c3b3",
    "474": "c3d3",
    "475": "c3e3",
    "476": "c3f3",
    "477": "c3g3",
    "478": "c3h3",
    "479": "c3b4",
    "480": "c3c4",
    "481": "c3d4",
    "482": "c3a5",
    "483": "c3c5",
    "484": "c3e5",
    "485": "c3c6",
    "486": "c3f6",
    "487": "c3c7",
    "488": "c3g7",
    "489": "c3c8",
    "490": "c3h8",
    "491": "c3b1",
    "492": "c3d1",
    "493": "c3a2",
    "494": "c3e2",
    "495": "c3a4",
    "496": "c3e4",
    "497": "c3b5",
    "498": "c3d5",
    "499": "d3b1",
    "500": "d3d1",
    "501": "d3f1",
    "502": "d3c2",
    "503": "d3d2",
    "504": "d3e2",
    "505": "d3a3",
    "506": "d3b3",
    "507": "d3c3",
    "508": "d3e3",
    "509": "d3f3",
    "510": "d3g3",
    "511": "d3h3",
    "512": "d3c4",
    "513": "d3d4",
    "514": "d3e4",
    "515": "d3b5",
    "516": "d3d5",
    "517": "d3f5",
    "518": "d3a6",
    "519": "d3d6",
    "520": "d3g6",
    "521": "d3d7",
    "522": "d3h7",
    "523": "d3d8",
    "524": "d3c1",
    "525": "d3e1",
    "526": "d3b2",
    "527": "d3f2",
    "528": "d3b4",
    "529": "d3f4",
    "530": "d3c5",
    "531": "d3e5",
    "532": "e3c1",
    "533": "e3e1",
    "534": "e3g1",
    "535": "e3d2",
    "536": "e3e2",
    "537": "e3f2",
    "538": "e3a3",
    "539": "e3b3",
    "540": "e3c3",
    "541": "e3d3",
    "542": "e3f3",
    "543": "e3g3",
    "544": "e3h3",
    "545": "e3d4",
    "546": "e3e4",
    "547": "e3f4",
    "548": "e3c5",
    "549": "e3e5",
    "550": "e3g5",
    "551": "e3b6",
    "552": "e3e6",
    "553": "e3h6",
    "554": "e3a7",
    "555": "e3e7",
    "556": "e3e8",
    "557": "e3d1",
    "558": "e3f1",
    "559": "e3c2",
    "560": "e3g2",
    "561": "e3c4",
    "562": "e3g4",
    "563": "e3d5",
    "564": "e3f5",
    "565": "f3d1",
    "566": "f3f1",
    "567": "f3h1",
    "568": "f3e2",
    "569": "f3f2",
    "570": "f3g2",
    "571": "f3a3",
    "572": "f3b3",
    "573": "f3c3",
    "574": "f3d3",
    "575": "f3e3",
    "576": "f3g3",
    "577": "f3h3",
    "578": "f3e4",
    "579": "f3f4",
    "580": "f3g4",
    "581": "f3d5",
    "582": "f3f5",
    "583": "f3h5",
    "584": "f3c6",
    "585": "f3f6",
    "586": "f3b7",
    "587": "f3f7",
    "588": "f3a8",
    "589": "f3f8",
    "590": "f3e1",
    "591": "f3g1",
    "592": "f3d2",
    "593": "f3h2",
    "594": "f3d4",
    "595": "f3h4",
    "596": "f3e5",
    "597": "f3g5",
    "598": "g3e1",
    "599": "g3g1",
    "600": "g3f2",
    "601": "g3g2",
    "602": "g3h2",
    "603": "g3a3",
    "604": "g3b3",
    "605": "g3c3",
    "606": "g3d3",
    "607": "g3e3",
    "608": "g3f3",
    "609": "g3h3",
    "610": "g3f4",
    "611": "g3g4",
    "612": "g3h4",
    "613": "g3e5",
    "614": "g3g5",
    "615": "g3d6",
    "616": "g3g6",
    "617": "g3c7",
    "618": "g3g7",
    "619": "g3b8",
    "620": "g3g8",
    "621": "g3f1",
    "622": "g3h1",
    "623": "g3e2",
    "624": "g3e4",
    "625": "g3f5",
    "626": "g3h5",
    "627": "h3f1",
    "628": "h3h1",
    "629": "h3g2",
    "630": "h3h2",
    "631": "h3a3",
    "632": "h3b3",
    "633": "h3c3",
    "634": "h3d3",
    "635": "h3e3",
    "636": "h3f3",
    "637": "h3g3",
    "638": "h3g4",
    "639": "h3h4",
    "640": "h3f5",
    "641": "h3h5",
    "642": "h3e6",
    "643": "h3h6",
    "644": "h3d7",
    "645": "h3h7",
    "646": "h3c8",
    "647": "h3h8",
    "648": "h3g1",
    "649": "h3f2",
    "650": "h3f4",
    "651": "h3g5",
    "652": "a4a1",
    "653": "a4d1",
    "654": "a4a2",
    "655": "a4c2",
    "656": "a4a3",
    "657": "a4b3",
    "658": "a4b4",
    "659": "a4c4",
    "660": "a4d4",
    "661": "a4e4",
    "662": "a4f4",
    "663": "a4g4",
    "664": "a4h4",
    "665": "a4a5",
    "666": "a4b5",
    "667": "a4a6",
    "668": "a4c6",
    "669": "a4a7",
    "670": "a4d7",
    "671": "a4a8",
    "672": "a4e8",
    "673": "a4b2",
    "674": "a4c3",
    "675": "a4c5",
    "676": "a4b6",
    "677": "b4b1",
    "678": "b4e1",
    "679": "b4b2",
    "680": "b4d2",
    "681": "b4a3",
    "682": "b4b3",
    "683": "b4c3",
    "684": "b4a4",
    "685": "b4c4",
    "686": "b4d4",
    "687": "b4e4",
    "688": "b4f4",
    "689": "b4g4",
    "690": "b4h4",
    "691": "b4a5",
    "692": "b4b5",
    "693": "b4c5",
    "694": "b4b6",
    "695": "b4d6",
    "696": "b4b7",
    "697": "b4e7",
    "698": "b4b8",
    "699": "b4f8",
    "700": "b4a2",
    "701": "b4c2",
    "702": "b4d3",
    "703": "b4d5",
    "704": "b4a6",
    "705": "b4c6",
    "706": "c4c1",
    "707": "c4f1",
    "708": "c4a2",
    "709": "c4c2",
    "710": "c4e2",
    "711": "c4b3",
    "712": "c4c3",
    "713": "c4d3",
    "714": "c4a4",
    "715": "c4b4",
    "716": "c4d4",
    "717": "c4e4",
    "718": "c4f4",
    "719": "c4g4",
    "720": "c4h4",
    "721": "c4b5",
    "722": "c4c5",
    "723": "c4d5",
    "724": "c4a6",
    "725": "c4c6",
    "726": "c4e6",
    "727": "c4c7",
    "728": "c4f7",
    "729": "c4c8",
    "730": "c4g8",
    "731": "c4b2",
    "732": "c4d2",
    "733": "c4a3",
    "734": "c4e3",
    "735": "c4a5",
    "736": "c4e5",
    "737": "c4b6",
    "738": "c4d6",
    "739": "d4a1",
    "740": "d4d1",
    "741": "d4g1",
    "742": "d4b2",
    "743": "d4d2",
    "744": "d4f2",
    "745": "d4c3",
    "746": "d4d3",
    "747": "d4e3",
    "748": "d4a4",
    "749": "d4b4",
    "750": "d4c4",
    "751": "d4e4",
    "752": "d4f4",
    "753": "d4g4",
    "754": "d4h4",
    "755": "d4c5",
    "756": "d4d5",
    "757": "d4e5",
    "758": "d4b6",
    "759": "d4d6",
    "760": "d4f6",
    "761": "d4a7",
    "762": "d4d7",
    "763": "d4g7",
    "764": "d4d8",
    "765": "d4h8",
    "766": "d4c2",
    "767": "d4e2",
    "768": "d4b3",
    "769": "d4f3",
    "770": "d4b5",
    "771": "d4f5",
    "772": "d4c6",
    "773": "d4e6",
    "774": "e4b1",
    "775": "e4e1",
    "776": "e4h1",
    "777": "e4c2",
    "778": "e4e2",
    "779": "e4g2",
    "780": "e4d3",
    "781": "e4e3",
    "782": "e4f3",
    "783": "e4a4",
    "784": "e4b4",
    "785": "e4c4",
    "786": "e4d4",
    "787": "e4f4",
    "788": "e4g4",
    "789": "e4h4",
    "790": "e4d5",
    "791": "e4e5",
    "792": "e4f5",
    "793": "e4c6",
    "794": "e4e6",
    "795": "e4g6",
    "796": "e4b7",
    "797": "e4e7",
    "798": "e4h7",
    "799": "e4a8",
    "800": "e4e8",
    "801": "e4d2",
    "802": "e4f2",
    "803": "e4c3",
    "804": "e4g3",
    "805": "e4c5",
    "806": "e4g5",
    "807": "e4d6",
    "808": "e4f6",
    "809": "f4c1",
    "810": "f4f1",
    "811": "f4d2",
    "812": "f4f2",
    "813": "f4h2",
    "814": "f4e3",
    "815": "f4f3",
    "816": "f4g3",
    "817": "f4a4",
    "818": "f4b4",
